Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-004-methods-and-standards__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 子墨子曰：天下從事者，不可以無法儀。無法儀而其事能成者，無有也。雖至士之爲將相者皆有法，雖至百工從事者亦皆有法。
en: Oh the Necessity.oe Stahdaeds Motse said: To accomplish anjrthing whatsoever one must have standards. None has yet accomplished anything without them. The gentlemen fulfilling their duties as generals and councillors have their standards. Even the artisans performing their tasks also have their standards. The artisans make square objects according to the square, circular objects according to the compasses; they draw straight lines with the carpenter’s line and find the perpendicular by a pendulum.

source: 百工爲方以矩，爲圓以規，直以繩，正以縣。
en: All artisans, whether skilled or unskilled, employ these five standards.

source: 無巧工不巧工，皆以此五者爲法。
en: Only, the skilled workers are accurate.

source: 巧者能中之，不巧者雖不能中，放依以從事，猶逾己。故百工從事，皆有法所度。
en: Though the unskilled labourers have not attained accuracy, yet they do better by followiag these standards than otherwise. Thus all artisans follow the standards in their work. Now, the government of the empire and that of the large states do not observe their standards.

source: 今大者治天下，其次治大國，而無法所度，此不若百工辯也。然則奚以爲治法而可？
en: This shows the governors are even less intelligent than the artisans. What, then, should be taken as the proper standard m government? How will it do for everybody to imitate which is somehow here omitted, namely find the level with water but few are magnanimous. For everybody to imitate Ms parents is to imitate the unmagnanimous. Imitating the unmagnanimous can not be said to be following the proper standard. How will it do for everybody to follow his teacher?

source: 當皆法其父母奚若？天下之爲父母者衆，而仁者寡，若皆法其父母，此法不仁也。
en: There are numerous teachers in the world but few are magnanimous. For everybody to imitate his teacher is to imitate the unmagnanimous. Imitating the un-magnanimous cannot be taken as following the proper standard. How will it do for everybody to imitate his ruler? There are many rulers in the world but few are magnanimous.

source: 法不仁，不可以爲法。當皆法其學奚若？天下之爲學者眾，而仁者寡，若皆法其學，此法不仁也。法不仁，不可以爲法。
en: For everybody to imitate the ruler is to imitate the unmagnanimous. Imitating the iinmagnanimous cannot be taken as following the right standard. So then neither the parents nor the teacher nor the ruler should be accepted as the standard in government. What then should be taken as the standard in government? Nothing better than following Heaven. Heaven is all-inclusive and impartial in its activities, abundant and unceasing in its blessings, and lasting and imtiring in its guidance.

source: 當皆法其君奚若？天下之爲君者眾，而仁者寡，若皆法其君，此法不仁也。法不仁，不可以爲法。
en: And, so, when the sage-kings had accepted Heaven as their standard, they measured every action and enterprise by Heaven.

source: 故父母、學、君三者，莫可以爲治法。然則奚以爲治法而可？故曰：莫若法天。天之行廣而無私，其施厚而不德，其明久而不衰，故聖王法之。
en: W"hat Heaven desired they would carry out, what Heaven abominated they refrained from. Now, what is it that Heaven desires, and what that it abominates? Certainly Heaven desires to have men benefit and love one another and abominates to have them hate and harm one another.

source: 旣以天爲法，動作有爲必度於天，天之所欲則爲之，天所不欲則止。然而天何欲何惡者也？
en: How do we know that Heaven desires to have men love and benefit one another and abominates to have them hate and harm one another?

source: 天必欲人之相愛相利，而不欲人之相惡相賊也。
en: Because it lo¥es and benefits men universally.

source: 奚以知天之欲人之相愛相利，而不欲人之相惡相賊也？
en: How do we know that it loves and benefits men universally?

source: 以其兼而愛之、兼而利之也。奚以知天兼而愛之、兼而利之也？以其兼而有之、兼而食之也。今天下無小大國，皆天之邑也。人無幼長貴賤，皆天之臣也。此以莫不犓羊，豢犬豬，絜爲酒醴粢盛，以敬事天。
en: Because it claims all and accepts offerings from all. All states in the world, large or small, are cities of Heaven, and all people young or old, honourable or humble, are its subjects; for they ail graze oxen and sheep, feed dogs and pigs, and prepare clean wine and cakes to sacrifice to Heaven. Does this not mean that Heaven claims all and accepts offerings from all? Since Heaven does claim all and accepts offerings from all, what then can make us say that it does not desire men to love and benefit one another? Hence those who love and benefit others Heaven will bless.

source: 此不爲兼而有之、兼而食之邪？天苟兼而有食之，夫奚說以不欲人之相愛相利也？故曰：「愛人利人者，天必福之。
en: Those who hate and harm others Heaven will curse, for it is said that he who murders the innocent will be visited by misfortune.

source: 惡人賊人者，天必禍之。日殺不辜者，得不祥焉。」夫奚說人爲其相殺而天與禍乎？
en: How else can we explain the fact that men, murdering each other, will be cursed by Heaven?

source: 是以知天欲人相愛相利，而不欲人相惡相賊也。昔之聖王禹、湯、文、武，兼愛天下之百姓，率以尊天事鬼，其利人多，故天福之，使立爲天子，天下諸侯皆賓事之。
en: Thus we are certain that Heaven desires to have men love and benefit one another and abominates to have them hate and harm one another. The ancient sage-kings, Yii, T’ang, Wen, and Wu loved the people of the world universally, leading them to reverence Heaven and worship the spirits. Many were their benefits to the people. And, thereupon Heaven blessed them, establishing them emperors; and all the feudal lords of the empire showed them respect. (On the other hand) the wicked kings, CSbieh, Chow, Yu, and Li, hated all the people in the world, seducing the people to curse Heaven and ridicule the spirits. Great were their injuries to the people.

source: 暴王桀、紂、幽、厲，兼惡天下之百姓，率以詬天侮鬼，其賊人多，故天禍之，使遂失其國家，身死爲僇於天下，後世子孫毀之，至今不息。
en: Thereupon Heaven brought them calamity, depriving them of their empire and their lives; and posterity condemned them to this day. Chieh, Chow, Yu, and Li, then, are those that committed evil and were visited by calamities.

source: 故爲不善以得禍者，桀、紂、幽、厲是也；愛人利人以得福者，禹、湯、文、武是也。愛人利人以得福者有矣，惡人賊人以得禍者亦有矣。
en: And, Yii, T’ang, Wen, and Wii are those that loved and benefited the people and obtained blessings. Thus we have those who obtained blessings because they loved and benefited the people as well as those who were visited by calamities because they hated and harmed the people.
